## Plan 📝
```bash
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/apsitvarkom-dev/locations/us-east1/repositories/docker-apsitvarkom-dev]
google_storage_bucket.terraform_state_bucket: Refreshing state... [id=apsitvarkom-dev-bucket-tfstate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.artifact_registry_repo_admin_binding will be created
  + resource "google_project_iam_member" "artifact_registry_repo_admin_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "apsitvarkom-dev"
      + role    = "roles/artifactregistry.repoAdmin"
    }

  # google_service_account.ga_cd_account will be created
  + resource "google_service_account" "ga_cd_account" {
      + account_id   = "ga-delivery"
      + disabled     = false
      + display_name = "Continuous service delivery from GitHub Actions"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentplan -->